Ellenp2p/esp32-pet-tamagotchi/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Partition table: use the custom 16 MB layout in partitions.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# KOS v0.3.0 OTA support.
# Bootloader can roll back a bad app to the previous ota_0.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Compiler: optimize for size to fit BLE+WiFi+LVGL into the factory partition
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Bluetooth (NimBLE peripheral)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# LVGL 9 default configuration
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_IMAGE=y
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_ANIMIMG=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y

# Wi-Fi credentials intentionally left empty.
# Fill via `idf.py menuconfig` -> "Pet project defaults" -> Wi-Fi SSID / Password
# (or set the CONFIG_PET_WIFI_* env vars before invoking idf.py).
CONFIG_PET_WIFI_SSID=""
CONFIG_PET_WIFI_PASSWORD=""
CONFIG_PET_WIFI_MAX_RETRY=5
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y
